micropython/micropython/ports/raspberrypi/boards/adafruit_floppsy_rp2040/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Adafruit Floppsy RP2040"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO15)

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO17)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO16)

#define CIRCUITPY_BOARD_SPI         (1)
#define CIRCUITPY_BOARD_SPI_PIN     {{.clock = &pin_GPIO26, .mosi = &pin_GPIO27}}
